import re

def test_regex():
    items = ["C6969-นายตชด-ประชดเชื้อ", "C6970-นายสมชาย-ประชดเชื้อ", "C6971-นายสมหมาย-ประชดเชื้อ", 
             "C6972-นายสมศักดิ์-ประชดเชื้อ", "C6973-นายสมศรี-ประชดเชื้อ", "C6974-นายสมศักดิ์-ประชดเชื้อ", 
             "C6975-นายสมศักดิ์-ประชดเชื้อ", "C6976-นายสมศักดิ์-ประชดเชื้อ", "C6977-นายสมศักดิ์-ประชดเชื้อ", 
             "C6978-นายสมศักดิ์-ประชดเชื้อ", "C6979-นายสมศักดิ์-ประชดเชื้อ", "C6980-นายสมศักดิ์-ประชดเชื้อ", 
             "C6981-นายสมศักดิ์-ประชดเชื้อ", "C6982-นายสมศักดิ์-ประชดเชื้อ", "C6983-นายสมศักดิ์-ประชดเชื้อ", 
             "C6984-นายสมศักดิ์-ประชดเชื้อ", "C6985-นายสมศักดิ์-ประชดเชื้อ", "C6986-นายสมศักดิ์-ประชดเชื้อ", 
             "C6987-นายสมศักดิ์-ประชดเชื้อ", "C6988-นายสมศักดิ์-ประชดเชื้อ", "C6989-นายสมศักดิ์-ประชดเชื้อ", 
             "C6990-นายสมศักดิ์-ประชดเชื้อ", "C6991-นายสมศักดิ์-ประชดเชื้อ", "C6992-นายสมศักดิ์-ประชดเชื้อ", 
             "C6993-นายสมศักดิ์-ประชดเชื้อ", "C6994-นายสมศักดิ์-ประชดเชื้อ", "C6995-นายสมศักดิ์-ประชดเชื้อ", 
             "C6996-นายสมศักดิ์-ประชดเชื้อ", "C6997-นายสมศักดิ์-ประชดเชื้อ", "C6998-นายสมศักดิ์-ประชดเชื้อ", 
             "C6999-นายสมศักดิ์-ประชดเชื้อ", "C7000-นายสมศักดิ์-ประชดเชื้อ", "C7001-นายสมศักดิ์-ประชดเชื้อ", 
             "C7002-นายสมศักดิ์-ประชดเชื้อ", "C7003-นายสมศักดิ์-ประชดเชื้อ", "C7004-นายสมศักดิ์-ประชดเชื้อ", 
             "C7005-นายสมศักดิ์-ประชดเชื้อ", "C7006-นายสมศักดิ์-ประชดเชื้อ", "C7007-นายสมศักดิ์-ประชดเชื้อ", 
             "C7008-นายสมศักดิ์-ประชดเชื้อ", "C7009-นายสมศักดิ์-ประชดเชื้อ", "C7010-นายสมศักดิ์-ประชดเชื้อ", 
             "C7011-นายสมศักดิ์-ประชดเชื้อ", "C7012-นายสมศักดิ์-ประชดเชื้อ", "C7013-นายสมศักดิ์-ประชดเชื้อ", 
             "C7014-นายสมศักดิ์-ประชดเชื้อ", "C7015-นายสมศักดิ์-ประชดเชื้อ", "C7016-นายสมศักดิ์-ประชดเชื้อ", 
             "C7017-นายสมศักดิ์-ประชดเชื้อ", "C7018-นายสมศักดิ์-ประชดเชื้อ", "C7019-นายสมศักดิ์-ประชดเชื้อ", 
             "C7020-นายสมศักดิ์-ประชดเชื้อ"]
    
    prog = re.search(r'[^-]-(.*)', items[0])
    assert prog.group(1) == "นายตชด-ประชดเชื้อ"
    

    # for item in items:
    #     prog = re.search(r'[^-]-(.*)', item)
    #     print(prog.group(1))
    #     assert prog.group(1) == item.split('-', 1)[1]


test_regex()

